## import labraries

In [1]:
import pandas as pd
import numpy as np

## Loading datasets

In [2]:
data = pd.read_csv("Datasets/Iris_data_sample.csv")

## displaying data

In [3]:
data.head()

,Unnamed: 0,SepalLengthCm,SepalWidthCm,PetalLengthCm,PetalWidthCm,Species
0,1,5.1,3.5,1.4,0.2,Iris-setosa
1,2,4.9,NaN,1.4,0.2,NaN
2,3,4.7,3.2,1.3,0.2,Iris-setosa
3,4,??,3.1,1.5,0.2,Iris-setosa
4,5,5,3.6,###,0.2,Iris-setosa

In [4]:
data2 = pd.read_csv("Datasets/Iris_data_sample.csv", index_col =0, na_values=["??","###"])

In [5]:
data2

     SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm         Species
1              5.1           3.5            1.4           0.2     Iris-setosa
2              4.9           NaN            1.4           0.2             NaN
3              4.7           3.2            1.3           0.2     Iris-setosa
4              NaN           3.1            1.5           0.2     Iris-setosa
5              5.0           3.6            NaN           0.2     Iris-setosa
..             ...           ...            ...           ...             ...
146            6.7           3.0            5.2           2.3  Iris-virginica
147            6.3           2.5            5.0           1.9  Iris-virginica
148            6.5           3.0            5.2           2.0  Iris-virginica
149            6.2           3.4            5.4           2.3  Iris-virginica
150            5.9           3.0            5.1           1.8  Iris-virginica

[150 rows x 5 columns]

In [6]:
data3 = pd.read_csv("Datasets/Toyota.csv")

In [7]:
data3

,Unnamed: 0,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,0,13500,23.0,46986,Diesel,90,1.0,0,2000,three,1165
1,1,13750,23.0,72937,Diesel,90,1.0,0,2000,3,1165
2,2,13950,24.0,41711,Diesel,90,NaN,0,2000,3,1165
3,3,14950,26.0,48000,Diesel,90,0.0,0,2000,3,1165
4,4,13750,30.0,38500,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...,...
1431,1431,7500,NaN,20544,Petrol,86,1.0,0,1300,3,1025
1432,1432,10845,72.0,??,Petrol,86,0.0,0,1300,3,1015
1433,1433,8500,NaN,17016,Petrol,86,0.0,0,1300,3,1015
1434,1434,7250,70.0,??,NaN,86,1.0,0,1300,3,1015
1435,1435,6950,76.0,1,Petrol,110,0.0,0,1600,5,1114

In [8]:
data4 = pd.read_csv("Datasets/Toyota.csv",index_col =0, na_values=["??"])

In [9]:
data4

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110,0.0,0,1600,5,1114

## creating a copy of data4

In [10]:
df = data4.copy(deep = True)

In [11]:
df

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
0,13500,23.0,46986.0,Diesel,90,1.0,0,2000,three,1165
1,13750,23.0,72937.0,Diesel,90,1.0,0,2000,3,1165
2,13950,24.0,41711.0,Diesel,90,NaN,0,2000,3,1165
3,14950,26.0,48000.0,Diesel,90,0.0,0,2000,3,1165
4,13750,30.0,38500.0,Diesel,90,0.0,0,2000,3,1170
...,...,...,...,...,...,...,...,...,...,...
1431,7500,NaN,20544.0,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110,0.0,0,1600,5,1114

In [12]:
## Understanding data

In [13]:
df.index

Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
       ...
       1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
      dtype='int64', length=1436)

In [14]:
df.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [15]:
df.shape

(1436, 10)

In [16]:
df.size

14360

In [17]:
df.head()

   Price   Age       KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986.0   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937.0   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711.0   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000.0   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500.0   Diesel  90       0.0          0  2000      3    1170

In [18]:
df.tail()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight
1431,7500,NaN,20544.0,Petrol,86,1.0,0,1300,3,1025
1432,10845,72.0,NaN,Petrol,86,0.0,0,1300,3,1015
1433,8500,NaN,17016.0,Petrol,86,0.0,0,1300,3,1015
1434,7250,70.0,NaN,NaN,86,1.0,0,1300,3,1015
1435,6950,76.0,1.0,Petrol,110,0.0,0,1600,5,1114

In [20]:
df.loc[:, "Price"]

0       13500
1       13750
2       13950
3       14950
4       13750
        ...
1431     7500
1432    10845
1433     8500
1434     7250
1435     6950
Name: Price, Length: 1436, dtype: int64

In [21]:
df.at[0, "Age"]

23.0

## Exploratory Data Analysis

In [22]:
df.dtypes

Price          int64
Age          float64
KM           float64
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [23]:
## checking the datatypes for each column
df.nunique()

Price         236
Age            77
KM           1255
FuelType        3
HP             13
MetColor        2
Automatic       2
CC             12
Doors           7
Weight         59
dtype: int64

In [24]:
## select columns with numerical datatypes
df.select_dtypes(exclude=[object])

      Price   Age       KM  MetColor  Automatic    CC  Weight
0     13500  23.0  46986.0       1.0          0  2000    1165
1     13750  23.0  72937.0       1.0          0  2000    1165
2     13950  24.0  41711.0       NaN          0  2000    1165
3     14950  26.0  48000.0       0.0          0  2000    1165
4     13750  30.0  38500.0       0.0          0  2000    1170
...     ...   ...      ...       ...        ...   ...     ...
1431   7500   NaN  20544.0       1.0          0  1300    1025
1432  10845  72.0      NaN       0.0          0  1300    1015
1433   8500   NaN  17016.0       0.0          0  1300    1015
1434   7250  70.0      NaN       1.0          0  1300    1015
1435   6950  76.0      1.0       0.0          0  1600    1114

[1436 rows x 7 columns]

In [25]:
##check the summary of the dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 155.7+ KB

In [26]:
num_cols = df.select_dtypes(exclude=[object])
num_cols

      Price   Age       KM  MetColor  Automatic    CC  Weight
0     13500  23.0  46986.0       1.0          0  2000    1165
1     13750  23.0  72937.0       1.0          0  2000    1165
2     13950  24.0  41711.0       NaN          0  2000    1165
3     14950  26.0  48000.0       0.0          0  2000    1165
4     13750  30.0  38500.0       0.0          0  2000    1170
...     ...   ...      ...       ...        ...   ...     ...
1431   7500   NaN  20544.0       1.0          0  1300    1025
1432  10845  72.0      NaN       0.0          0  1300    1015
1433   8500   NaN  17016.0       0.0          0  1300    1015
1434   7250  70.0      NaN       1.0          0  1300    1015
1435   6950  76.0      1.0       0.0          0  1600    1114

[1436 rows x 7 columns]

In [27]:
## checking the number of unique values in each column
print(np.unique(df["HP"]))

['107' '110' '116' '192' '69' '71' '72' '73' '86' '90' '97' '98' '????']

In [28]:
## checking the number of unique values in each column
print(np.unique(df["Doors"]))

['2' '3' '4' '5' 'five' 'four' 'three']

In [29]:
## checking the number of unique values in each column
print(np.unique(df["KM"]))

[1.0000e+00 1.5000e+01 2.2500e+02 ... 2.3294e+05 2.4300e+05        nan]